# ファイル操作
# とりあえず2通りの紹介(個人的にはwith使ってね)


# ----------------------------------------------------
# まずは読み込むテキストファイルを作成する
# ----------------------------------------------------
f = open('readme.txt', 'w')
f.write('こんにちは！')
f.flush()
f.close()

# ----------------------------------------------------
# 次に先ほど作成したreadme.txtを読み込み、printする
# ----------------------------------------------------
r = open('readme.txt', 'r')
# readline()はファイルの先頭から１行だけ読み込みその結果を返す
readme = r.readline()
r.close()

print(readme)  # こんにちは！

with open('test.txt', 'w') as f:
    f.write('test')

with open('test.txt') as f:
    print(f.read())
