# リストに関するエトセトラ
# 文字列からリストへ
# s1 = '月火水木金土日'
# print(list(s1))
# リストの参照方法
li_1 = ['月', '火', '水', '木', '金', '土', '日']
print(li_1[0])
# print(li_1[-1])
# 2次元配列
# li_2 = [['長野', '山梨', '岐阜'], ['神奈川', '静岡', '愛知']]
# print(li_2[0])
# print(li_2[0][0])
# 文字列の追加1
# li3 = ['諾威', '瑞典', '丁抹']
# li3[0] = '波蘭'
# print(li3)
# リストの抽出、逆順
# s2 = '震食倒毒末金戦帰虎災愛命偽変新暑絆金輪税安金北'
# li4 = list(s2)
# print(len(s2))
# print(li4[0:9])
# print(li4[1:7])
# print(li4[0:2:9])
# print(list[::-1])
# 文字列の追加2
# li5 = ['イチゴ', 'リンゴ', 'ミカン']
# li5.append("ナシ")
# print(li5)
# # 文字列の追加3
# li6 = ['10000', '5000', '2000', '1000']
# li7 = ['500', '100', '50', '10', '5', '1']
# li6.extend(li7)
# # 文字列の削除
# li8 = ['tullys', 'georgia', 'fire', 'boss']
# del li8[1]
# print(li8)
